app/controllers/quotes_controller.rb

  def index
    @quote = Quote.order("RANDOM()").first
---
SELECT  "quotes".* FROM "quotes" ORDER BY "quotes"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def create
    @quote = Quote.create(quote_params)
---
INSERT INTO "quotes" ("saying", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"